### [ 인덱스 다루기 ]
- 기본 인덱스
    * .set_index()      <-- 컬럼을 인덱스로 설정>
    * .reindex()        <-- 인덱스 재구성(일부 변경, 결측치 발생 가능)>
    * .reset_index()    <-- 위치 인덱스(RangeIndex)로 변경. 기존 인덱스는 컬럼 추가>

[1] 모듈 로딩 및 데이터 준비 <hr>

In [80]:
## 모듈 로딩
import pandas as pd

In [81]:
## 데이터 준비
DATA_FILE = '../Data/학생관리부.xlsx'

## excel --> DF 로딩
## skiprows : 상단의 행 버리기
## index_col : 해당 컬럼 index로 설정
# dataDF = pd.read_excel(DATA_FILE, skiprows=2, index_col=0)
dataDF = pd.read_excel(DATA_FILE, skiprows=2)

In [82]:
## 확인
display(dataDF.head())

    이름  학년  반   석차
0  홍길동   1  1    8
1  고길동   1  3    1
2  이길동   1  7   12
3  박길동   3  1    9
4  최길동   2  1   43

[2] DF에서 인덱스관련 메서드 다루기 <hr>

In [83]:
## ----------------------------------------------------------
## [2-1] 컬럼을 인덱스로 설정 : .set_index()
## ----------------------------------------------------------
dataDF2 = dataDF.set_index(['이름']).sort_index().copy()

dataDF2

     학년  반   석차
이름
고길동   1  3    1
박길동   3  1    9
이길동   1  7   12
최길동   2  1   43
홍길동   1  1    8

In [84]:
## -> [실습] 석차 컬럼이 인덱스 설정 및 내림차순 정렬
display(dataDF.index)

dataDF3 = dataDF.set_index([' 석차']).sort_index(ascending=False)
dataDF3

RangeIndex(start=0, stop=5, step=1)

      이름  학년  반
 석차
43   최길동   2  1
12   이길동   1  7
9    박길동   3  1
8    홍길동   1  1
1    고길동   1  3

In [85]:
## -> [매개변수 활용] 특정 컬럼이 행인덱스 가능한지 검사 진행
##                  대량의 데이터 경우 행 중복값
# dataDF3 = dataDF.set_index(['학년'], verify_integrity = True)

In [86]:
## [문제] 2개 이상의 컬럼을 조합해서 행인덱스로 설정된 DF 설정
dataDF4 = dataDF.set_index(['이름', '학년'], verify_integrity=True)
dataDF4

        반   석차
이름  학년
홍길동 1   1    8
고길동 1   3    1
이길동 1   7   12
박길동 3   1    9
최길동 2   1   43

In [87]:
## ----------------------------------------------------------
## [2-2] 인덱스 재구성/재배치 : .reindex(index = [], columns = [])
##                           .reindex(labels = [], axis = 0/1)
## ----------------------------------------------------------
display(dataDF)

    이름  학년  반   석차
0  홍길동   1  1    8
1  고길동   1  3    1
2  이길동   1  7   12
3  박길동   3  1    9
4  최길동   2  1   43

In [88]:
## 이름, 학년, 반, 석차 ==> 학년 반 이름 석차 열이름/ 열인덱스를 재배치/재구성
# dataDF.reindex(labels=['학년', '반', '이름', ' 석차'], axis = 1)
dataDF.reindex(columns=['학년', '반', '이름', ' 석차'])

   학년  반   이름   석차
0   1  1  홍길동    8
1   1  3  고길동    1
2   1  7  이길동   12
3   3  1  박길동    9
4   2  1  최길동   43

In [89]:
## 이름, 학년, 반, 석차 ==> 학교, 이름, 학년, 반, 번호 열이름/ 열인덱스를 재배치/재구성
## 기존 없던 것 추가 : 학교, 번호
## 기존 있던 것 추가 : 석차 
testDF = dataDF.reindex(labels=['학교','이름','학년','반','번호'], axis='columns')
testDF['학교'] = ['경북대' for _ in range(len(dataDF.index))]
testDF

    학교   이름  학년  반  번호
0  경북대  홍길동   1  1 NaN
1  경북대  고길동   1  3 NaN
2  경북대  이길동   1  7 NaN
3  경북대  박길동   3  1 NaN
4  경북대  최길동   2  1 NaN

In [91]:
## ----------------------------------------------------------
## [2-3] 인덱스 초기화 : .reset_index()
##                     기존 행인덱스는 컬럼으로 추가됨
## ----------------------------------------------------------
display(dataDF)

    이름  학년  반   석차
0  홍길동   1  1    8
1  고길동   1  3    1
2  이길동   1  7   12
3  박길동   3  1    9
4  최길동   2  1   43

In [ ]:
## 인덱스 초기화 : [기본] 행인덱스가 => 컬럼으로 추가됨
dataDF2 = dataDF.reset_index()
dataDF2

   index   이름  학년  반   석차
0      0  홍길동   1  1    8
1      1  고길동   1  3    1
2      2  이길동   1  7   12
3      3  박길동   3  1    9
4      4  최길동   2  1   43

In [99]:
## 인덱스 초기화 : [설정] 행인덱스 => 컬럼추가 x, drop=True
dataDF2 = dataDF.reset_index(drop=True)
dataDF2

    이름  학년  반   석차
0  홍길동   1  1    8
1  고길동   1  3    1
2  이길동   1  7   12
3  박길동   3  1    9
4  최길동   2  1   43

In [101]:
## -------------------------------------------------
## [실습] 행인덱스 초기화
## -------------------------------------------------
## => 4행 2열
dataDF = pd.DataFrame([ ('bird', 389.0),
                        ('bird', 24.0),
                        ('mammal', 80.5),
                        ('mammal', pd.NA)],
                        index=['falcon', 'parrot', 'lion', 'monkey'],
                        columns=('class', 'max_speed'))
display(dataDF)

         class max_speed
falcon    bird     389.0
parrot    bird      24.0
lion    mammal      80.5
monkey  mammal      <NA>

In [ ]:
## => [실습] 현재 행인덱스를 초기화 : 컬럼으로 전달되는 행인덱스 삭제 여부 결정
##                                필요 없는 데이터 drop=True
##                                필요 있는 데이터면 drop=False[기본]
dataDF.reset_index(names='kind')

     name   class max_speed
0  falcon    bird     389.0
1  parrot    bird      24.0
2    lion  mammal      80.5
3  monkey  mammal      <NA>